STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_hal_tamp.c
/**
  ******************************************************************************
  * @file    stm32u5xx_hal_tamp.c
  * @brief   TAMP HAL module driver.
  *          This file provides firmware functions to manage the following
  *          functionalities of the TAMP peripheral:
  *           + Passive tamper events
  *           + Active tamper events
  *           + Internal tamper events
  *           + Monotonic counter
  *           + Device secrets protection
  *           + Backup registers
  *
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32_hal.h"

/** @addtogroup STM32U5xx_HAL_Driver
  * @{
  */

/** @addtogroup TAMP
  * @brief TAMP HAL module driver
  * @{
  * The antitamper detection circuit is used to protect sensitive data from external
  * attacks. The detection is made on an event of the different tamper I/O or on internal
  * monitors detecting out-of-range device conditions.
  *
  * The TAMP driver provides:
  * * external tampers that can work in two modes:
  *   * active mode that is a continuous comparison between a tamper output and input
  *   * passive mode that are ultra-low power edge or level detection
  * * internal tampers to protect against transient or environmental perturbation
  * of the microcontroller
  * * monotonic counters
  * * backup registers read/write
  * * configuration of device secret protection
  *
  * The TAMP driver is part of the backup domain. When clocked by the LSE and powered through the VBAT pin,
  * it can be functional in all low-power modes.
  *
  * # TAMP operating condition
  *
  * The antitamper detection circuit is part of the backup domain and
  * can be powered from VBAT when the main VDD supply is powered off.
  * When VDD is turned off, it is possible to retain the content of the TAMP registers and supply the TAMP peripheral.
  * To do so, the VBAT can be connected to an optional standby voltage supplied by a battery or by another source.
  *
  * The TAMP clock also used by the RTC driver, is called RTCCLK and can come from different sources:
  * - HSE with a prescaler
  * - LSE
  * - LSI with a prescaler
  *
  * # Backup domain reset
  *
  * The backup domain reset sets all TAMP registers and the RCC_BDCR register to their reset values.
  * A backup domain reset occurs when:
  * * triggered by setting the BDRST bit in the RCC backup domain control register  (RCC_BDCR).
  * * totally powering off the microcontroller.
  *
  * # Backup domain access
  *
  * After reset, the backup domains are protected against possible unwanted write accesses.
  * To enable access to the TAMP domain and TAMP registers, proceed as follows:
  * * Enable the clock driving the power controller interface using the @ref HAL_RCC_PWR_EnableClock function
  * * Enable access to backup domain using the @ref HAL_PWR_DisableRTCDomainWriteProtection
  * function
  * * Select the RTC clock source using the @ref HAL_RCC_RTC_SetKernelClkSource function
  * * Enable RTCAPB clock using the @ref HAL_RCC_RTCAPB_EnableClock function
  *
  * # TAMP and microcontroller low power modes
  *
  * The MCU can be woken up from a low power mode by a tamper or internal tamper event.
  * These TAMP functions can wake up the system from the all low-power modes.
  * Wake-up from stop and standby mode is possible only when the TAMP clock source is LSE or LSI.
  * For shutdown mode it is only possible when the TAMP clock source is LSE.

Config defines                | Description      | Default value         | Note
------------------------------| -----------------| --------------------- | --------------------------------------------
USE_HAL_TAMP_MODULE           | hal_conf.h       | 1                     | When set, HAL TAMP module is enabled
USE_HAL_CHECK_PARAM           | hal_conf.h       | 0                     | When set, parameters are checked in runtime
USE_ASSERT_DBG_PARAM          | PreProcessor env | NA                    | When defined, enable the params assert

  */

#if defined(USE_HAL_TAMP_MODULE) && (USE_HAL_TAMP_MODULE == 1)

/* Private types -----------------------------------------------------------*/
/** @defgroup TAMP_Private_Types TAMP Private Types
  * @{
  */

/**
  * @}
  */

/* Private constants ---------------------------------------------------------*/
/** @defgroup TAMP_Private_Constants TAMP Private Constants
  * @{
  */

/**
  * @}
  */

/* Private macros -------------------------------------------------------------*/
/** @defgroup TAMP_Private_Macros TAMP Private Macros
  * @{
  */

/** @defgroup TAMP_Private_Macros_Assert_Tampers TAMP private macros for tampers.
  * @{
  */
#define IS_TAMP_TAMPERS(tampers) (((((tampers) & HAL_TAMP_TAMPER_1) == HAL_TAMP_TAMPER_1)     \
                                   || (((tampers) & HAL_TAMP_TAMPER_2) == HAL_TAMP_TAMPER_2)  \
                                   || (((tampers) & HAL_TAMP_TAMPER_3) == HAL_TAMP_TAMPER_3)  \
                                   || (((tampers) & HAL_TAMP_TAMPER_4) == HAL_TAMP_TAMPER_4)  \
                                   || (((tampers) & HAL_TAMP_TAMPER_5) == HAL_TAMP_TAMPER_5)  \
                                   || (((tampers) & HAL_TAMP_TAMPER_6) == HAL_TAMP_TAMPER_6)  \
                                   || (((tampers) & HAL_TAMP_TAMPER_7) == HAL_TAMP_TAMPER_7)  \
                                   || (((tampers) & HAL_TAMP_TAMPER_8) == HAL_TAMP_TAMPER_8)) \
                                  && (((tampers) & (~HAL_TAMP_TAMPER_ALL)) == 0U))
/*!< Tests tampers */

#define IS_TAMP_TAMPERS_IT(interruption) (((((interruption) & HAL_TAMP_IT_TAMPER_1) == HAL_TAMP_IT_TAMPER_1)    \
                                           || (((interruption) & HAL_TAMP_IT_TAMPER_2) == HAL_TAMP_IT_TAMPER_2) \
                                           || (((interruption) & HAL_TAMP_IT_TAMPER_3) == HAL_TAMP_IT_TAMPER_3) \
                                           || (((interruption) & HAL_TAMP_IT_TAMPER_4) == HAL_TAMP_IT_TAMPER_4) \
                                           || (((interruption) & HAL_TAMP_IT_TAMPER_5) == HAL_TAMP_IT_TAMPER_5) \
                                           || (((interruption) & HAL_TAMP_IT_TAMPER_6) == HAL_TAMP_IT_TAMPER_6) \
                                           || (((interruption) & HAL_TAMP_IT_TAMPER_7) == HAL_TAMP_IT_TAMPER_7) \
                                           || (((interruption) & HAL_TAMP_IT_TAMPER_8) == HAL_TAMP_IT_TAMPER_8) \
                                           || (interruption) == HAL_TAMP_IT_NONE)                               \
                                          && (((interruption) & (~HAL_TAMP_IT_ALL))==0U))
/*!< Tests tampers interruption */

/**
  * @}
  */


/** @defgroup TAMP_Private_Macros_Assert_Passive TAMP private macros for passive tampers.
  * @{
  */


#define IS_TAMP_PASSIVE_PRECHARGE_STATE(state) (((state) == HAL_TAMP_PASSIVE_PULL_UP_PRECHARGE_DISABLE ) \
                                                || ((state) == HAL_TAMP_PASSIVE_PULL_UP_PRECHARGE_ENABLE ))
/*!< Tests passive tamper precharge state */

#define IS_TAMP_PASSIVE_PRECHARGE_DURATION(duration) \
  (((duration) == HAL_TAMP_PASSIVE_PULL_UP_PRECHARGE_1_RTCCLK )    \
   || ((duration) == HAL_TAMP_PASSIVE_PULL_UP_PRECHARGE_2_RTCCLK ) \
   || ((duration) == HAL_TAMP_PASSIVE_PULL_UP_PRECHARGE_4_RTCCLK ) \
   || ((duration) == HAL_TAMP_PASSIVE_PULL_UP_PRECHARGE_8_RTCCLK ))
/*!< Tests passive tamper precharge duration */

#define IS_TAMP_PASSIVE_FILTER(filter) (((filter) == HAL_TAMP_PASSIVE_FILTER_DISABLE )      \
                                        || ((filter) == HAL_TAMP_PASSIVE_FILTER_2_SAMPLES ) \
                                        || ((filter) == HAL_TAMP_PASSIVE_FILTER_4_SAMPLES ) \
                                        || ((filter) == HAL_TAMP_PASSIVE_FILTER_8_SAMPLES ))
/*!< Tests passive tamper filter */

#define IS_TAMP_PASSIVE_SAMPLE_FREQUENCY(frequency) (((frequency) == HAL_TAMP_PASSIVE_SAMPLE_FREQ_DIV_256 )      \
                                                     || ((frequency) == HAL_TAMP_PASSIVE_SAMPLE_FREQ_DIV_512 )   \
                                                     || ((frequency) == HAL_TAMP_PASSIVE_SAMPLE_FREQ_DIV_1024 )  \
                                                     || ((frequency) == HAL_TAMP_PASSIVE_SAMPLE_FREQ_DIV_2048 )  \
                                                     || ((frequency) == HAL_TAMP_PASSIVE_SAMPLE_FREQ_DIV_4096 )  \
                                                     || ((frequency) == HAL_TAMP_PASSIVE_SAMPLE_FREQ_DIV_8192 )  \
                                                     || ((frequency) == HAL_TAMP_PASSIVE_SAMPLE_FREQ_DIV_16384 ) \
                                                     || ((frequency) == HAL_TAMP_PASSIVE_SAMPLE_FREQ_DIV_32768 ))
/*!< Tests passive tamper sample frequency*/

