STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_hal_tamp.c
#define IS_TAMP_PASSIVE_DETECTION(detection) (((detection) == HAL_TAMP_PASSIVE_TRIGGER_RISING )    \
                                              || ((detection) == HAL_TAMP_PASSIVE_TRIGGER_FALLING) \
                                              || ((detection) == HAL_TAMP_PASSIVE_TRIGGER_LOW)     \
                                              || ((detection) == HAL_TAMP_PASSIVE_TRIGGER_HIGH))
/*!< Tests passive tamper detection */

#define IS_TAMP_PASSIVE_ERASE(mode) (((mode) == HAL_TAMP_PASSIVE_SECRETS_ERASE ) \
                                     || ((mode) == HAL_TAMP_PASSIVE_SECRETS_NO_ERASE ))
/*!< Tests passive tamper erase mode */

#define IS_TAMP_PASSIVE_MASK(mask) (((mask) == HAL_TAMP_PASSIVE_UNMASKED ) \
                                    || ((mask) == HAL_TAMP_PASSIVE_MASKED ))
/*!< Tests passive tamper mask status */

/**
  * @}
  */

/** @defgroup TAMP_Private_Macros_Assert_Internal TAMP private macros for internal tampers.
  * @{
  */
#define IS_TAMP_INTERNAL_TAMPERS(tampers) (((((tampers) & HAL_TAMP_INTERNAL_TAMPER_1)     \
                                             == HAL_TAMP_INTERNAL_TAMPER_1)   \
                                            || (((tampers) & HAL_TAMP_INTERNAL_TAMPER_2)  \
                                                == HAL_TAMP_INTERNAL_TAMPER_2)   \
                                            || (((tampers) & HAL_TAMP_INTERNAL_TAMPER_3)  \
                                                == HAL_TAMP_INTERNAL_TAMPER_3)   \
                                            || (((tampers) & HAL_TAMP_INTERNAL_TAMPER_5)  \
                                                == HAL_TAMP_INTERNAL_TAMPER_5)   \
                                            || (((tampers) & HAL_TAMP_INTERNAL_TAMPER_6)  \
                                                == HAL_TAMP_INTERNAL_TAMPER_6)   \
                                            || (((tampers) & HAL_TAMP_INTERNAL_TAMPER_7)  \
                                                == HAL_TAMP_INTERNAL_TAMPER_7)   \
                                            || (((tampers) & HAL_TAMP_INTERNAL_TAMPER_8)  \
                                                == HAL_TAMP_INTERNAL_TAMPER_8)   \
                                            || (((tampers) & HAL_TAMP_INTERNAL_TAMPER_9)  \
                                                == HAL_TAMP_INTERNAL_TAMPER_9)   \
                                            || (((tampers) & HAL_TAMP_INTERNAL_TAMPER_11) \
                                                == HAL_TAMP_INTERNAL_TAMPER_11)  \
                                            || (((tampers) & HAL_TAMP_INTERNAL_TAMPER_12) \
                                                == HAL_TAMP_INTERNAL_TAMPER_12)  \
                                            || (((tampers) & HAL_TAMP_INTERNAL_TAMPER_13) \
                                                == HAL_TAMP_INTERNAL_TAMPER_13)) \
                                           && (((tampers) & (~HAL_TAMP_INTERNAL_ALL)) == 0U))
/*!< Tests internal tampers*/

#define IS_TAMP_INTERNAL_TAMPERS_IT(interruption) (((((interruption) & HAL_TAMP_INTERNAL_IT_TAMPER_1)     \
                                                     == HAL_TAMP_INTERNAL_IT_TAMPER_1)  \
                                                    || (((interruption) & HAL_TAMP_INTERNAL_IT_TAMPER_2)  \
                                                        == HAL_TAMP_INTERNAL_IT_TAMPER_2)  \
                                                    || (((interruption) & HAL_TAMP_INTERNAL_IT_TAMPER_3)  \
                                                        == HAL_TAMP_INTERNAL_IT_TAMPER_3)  \
                                                    || (((interruption) & HAL_TAMP_INTERNAL_IT_TAMPER_5)  \
                                                        == HAL_TAMP_INTERNAL_IT_TAMPER_5)  \
                                                    || (((interruption) & HAL_TAMP_INTERNAL_IT_TAMPER_6)  \
                                                        == HAL_TAMP_INTERNAL_IT_TAMPER_6)  \
                                                    || (((interruption) & HAL_TAMP_INTERNAL_IT_TAMPER_7)  \
                                                        == HAL_TAMP_INTERNAL_IT_TAMPER_7)  \
                                                    || (((interruption) & HAL_TAMP_INTERNAL_IT_TAMPER_8)  \
                                                        == HAL_TAMP_INTERNAL_IT_TAMPER_8)  \
                                                    || (((interruption) & HAL_TAMP_INTERNAL_IT_TAMPER_9)  \
                                                        == HAL_TAMP_INTERNAL_IT_TAMPER_9)  \
                                                    || (((interruption) & HAL_TAMP_INTERNAL_IT_TAMPER_11) \
                                                        == HAL_TAMP_INTERNAL_IT_TAMPER_11) \
                                                    || (((interruption) & HAL_TAMP_INTERNAL_IT_TAMPER_12) \
                                                        == HAL_TAMP_INTERNAL_IT_TAMPER_12) \
                                                    || (((interruption) & HAL_TAMP_INTERNAL_IT_TAMPER_13) \
                                                        == HAL_TAMP_INTERNAL_IT_TAMPER_13) \
                                                    || (interruption) == HAL_TAMP_INTERNAL_IT_NONE)       \
                                                   && (((interruption) & (~HAL_TAMP_INTERNAL_IT_ALL)) == 0U))
/*!< Tests internal tampers interruption */

#define IS_TAMP_INTERNAL_ERASE(mode) (((mode) == HAL_TAMP_INTERNAL_SECRETS_ERASE ) \
                                      || ((mode) == HAL_TAMP_INTERNAL_SECRETS_NO_ERASE ))
/*!< Tests internal tamper erase mode */

/**
  * @}
  */

/** @defgroup TAMP_Private_Macros_Assert_Active TAMP private macros for active tampers.
  * @{
  */

#define IS_TAMP_ACTIVE_OUTPUT_PERIOD(period) ((period) <= HAL_TAMP_OUTPUT_PERIOD)
/*!< Tests active tamper output period */

#define IS_TAMP_ACTIVE_FILTER(state) (((state) == HAL_TAMP_ACTIVE_FILTER_DISABLE ) \
                                      || ((state) == HAL_TAMP_ACTIVE_FILTER_ENABLE ))
/*!< Tests active tamper filter state */

#define IS_TAMP_ACTIVE_ASYNCHRONOUS_PRESCALER(division) (((division) == HAL_TAMP_ACTIVE_PRESCALER_RTCCLK)            \
                                                         || ((division) == HAL_TAMP_ACTIVE_PRESCALER_RTCCLK_DIV_2)   \
                                                         || ((division) == HAL_TAMP_ACTIVE_PRESCALER_RTCCLK_DIV_4)   \
                                                         || ((division) == HAL_TAMP_ACTIVE_PRESCALER_RTCCLK_DIV_8)   \
                                                         || ((division) == HAL_TAMP_ACTIVE_PRESCALER_RTCCLK_DIV_16)  \
                                                         || ((division) == HAL_TAMP_ACTIVE_PRESCALER_RTCCLK_DIV_32)  \
                                                         || ((division) == HAL_TAMP_ACTIVE_PRESCALER_RTCCLK_DIV_64)  \
                                                         || ((division) == HAL_TAMP_ACTIVE_PRESCALER_RTCCLK_DIV_128) \
                                                         || ((division) == HAL_TAMP_ACTIVE_PRESCALER_RTCCLK_DIV_2048))
/*!< Tests active tamper asynchronous prescaler */

#define IS_TAMP_ACTIVE_OUTPUT_SHARED(state) (((state) == HAL_TAMP_ACTIVE_TAMPER_OUTPUT_NOT_SHARED ) \
                                             || ((state) == HAL_TAMP_ACTIVE_TAMPER_OUTPUT_SHARED ))
/*!< Tests active tamper output sharing */

#define IS_TAMP_ACTIVE_ERASE(mode) (((mode) == HAL_TAMP_ACTIVE_SECRETS_ERASE ) \
                                    || ((mode) == HAL_TAMP_ACTIVE_SECRETS_NO_ERASE ))
/*!< Tests active tamper erase mode */

#define IS_TAMP_ACTIVE_TAMPER_OUTPUT(tamper) (((tamper) == HAL_TAMP_ACTIVE_TAMPER_OUTPUT_1)    \
                                              || ((tamper) == HAL_TAMP_ACTIVE_TAMPER_OUTPUT_2) \
                                              || ((tamper) == HAL_TAMP_ACTIVE_TAMPER_OUTPUT_3) \
                                              || ((tamper) == HAL_TAMP_ACTIVE_TAMPER_OUTPUT_4) \
                                              || ((tamper) == HAL_TAMP_ACTIVE_TAMPER_OUTPUT_5) \
                                              || ((tamper) == HAL_TAMP_ACTIVE_TAMPER_OUTPUT_6) \
                                              || ((tamper) == HAL_TAMP_ACTIVE_TAMPER_OUTPUT_7) \
                                              || ((tamper) == HAL_TAMP_ACTIVE_TAMPER_OUTPUT_8))
/*!< Tests active tamper outputs */

/**
  * @}
  */

/** @defgroup TAMP_Private_Macros_Assert_Monotonic_Counters TAMP private macros for monotonic counters.
  * @{
  */

#define IS_TAMP_MONOTONIC_COUNTER(counter) (((counter) == HAL_TAMP_MONOTONIC_1 ))
/*!< Tests monotonic counters */

/**
  * @}
  */

