STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_hal_tamp.c
/** @addtogroup TAMP_Exported_Functions_Active
  * @{
  *
  * The active mode consists of a continuous comparison between a random signal from a tamper output and
  * the signal input from a tamper input. In case of mismatch between the two signals
  * a tamper event is then triggered to protect the device secrets from physical open-short attacks
  * for example.
  *
  * # Random output signal
  *
  * ## Pseudo random number generator
  *
  * A pseudo random number generator computes the signal output of a tamper level.
  * The seed can be configured by this pseudo random number generator is programmed
  * by using the @ref HAL_TAMP_ACTIVE_SetSeed function.
  *
  * The clock that drives the PRNG change is the RTCCLK passing through a prescaler, called CK_ATPRE.
  * This prescaler can be configured by calling @ref HAL_TAMP_ACTIVE_SetConfig and programming
  * the parameter hal_tamp_active_config_t::asynchronous_prescaler.
  *
  * Programming  hal_tamp_active_config_t::asynchronous_prescaler to @ref HAL_TAMP_ACTIVE_PRESCALER_RTCCLK_DIV_2048
  * requires the asynchronous prescaler and synchronous prescaler of the RTC to be set
  * to 128 and a multiple of 16 respectively.
  *
  * Every ninth cycles of CK_ATPRE the value of the PRNG changes. The seed takes 184 APB clock to renew.
  * The application needs to wait for the seed to renew before entering a low power mode or switching
  * off the APB clock.
  *
  * ## Output change
  *
  * Another clock, CK_APER, drives the change in tamper output. CK_APER is generated from the same
  * source as the PRNG, but it is divided by two to the power of @ref hal_tamp_active_config_t::output_period.
  * @ref hal_tamp_active_config_t::output_period is configured by calling @ref HAL_TAMP_ACTIVE_SetConfig.
  *
  * Every two cycles the output value matches the last consumed value of the PRNG.
  * In between the two cycles, so after one cycle the value is the opposite.
  *
  * Depending on the number of outputs used the value of PRNG is consumed every :
  * * sixteen cycles with one output
  * * eight cycles with two outputs.
  * * four cycles with three or four outputs
  * * two cycles with five or more outputs.
  *
  * Choose the value of @ref hal_tamp_active_config_t::output_period according to the number
  * of outputs used and the fact that the PRNG changes only every ninth cycle of CK_ATPRE.
  *
  * # Comparison
  *
  * The comparison between the input and output signals is made every CK_ATPRE cycle. In
  * case a comparison mismatch occurs, a tamper event is triggered.
  *
  * By default the comparison is made between the same tamper input and output indexes. But
  * it is possible to use the same output for several tamper inputs.
  * This is configured by calling the @ref HAL_TAMP_ACTIVE_SetConfig and
  * @ref HAL_TAMP_ACTIVE_SetConfigTampers function.
  *
  * By calling @ref HAL_TAMP_ACTIVE_SetConfig and setting the
  * parameter hal_tamp_active_config_t::shared_output to @ref HAL_TAMP_ACTIVE_TAMPER_OUTPUT_SHARED, enables
  * the output sharing. To choose the output tamper for several input tampers
  * the user needs to call the function @ref HAL_TAMP_ACTIVE_SetConfigTampers by setting the parameter
  * @p tampers_input to the corresponding tampers input and
  * @ref hal_tamp_active_individual_config_t::tamper_output to the corresponding tamper output.
  *
  * The application can also apply a filter by calling @ref HAL_TAMP_ACTIVE_SetConfig and programming
  * @ref hal_tamp_active_config_t::filter with the value @ref  HAL_TAMP_ACTIVE_FILTER_ENABLE.
  * It makes a tamper event trigger only when two comparisons out of four consecutive comparisons are false.
  *
  * # Potential and confirmed mode.
  *
  * Each tamper can work in two modes regarding the device secrets erase. The confirmed mode means
  * that when a tamper event occurs the device secrets are automatically erased. The potential mode
  * does not erase all the device secrets when a tamper event occurs. Instead it blocks the read and write
  * access of the device secrets. The access is unblocked when the tamper event is cleared.
  *
  * To configure the erase mode call @ref HAL_TAMP_INTERNAL_SetConfigTampers and configure
  * the hal_tamp_internal_individual_config_t::erase_secrets parameter.
  *
  */

/**
  * @brief Configure the active tampers global parameters.
  * @param p_config Pointer to the active tampers global configuration instance.
  * @retval HAL_OK
  * @retval HAL_ERROR In STM32U575xx STM32U585xx the active tamper extension
  * is not present. The 2048 prescaler value can't be used.
  */
hal_status_t HAL_TAMP_ACTIVE_SetConfig(const hal_tamp_active_config_t *p_config)
{
  ASSERT_DBG_PARAM(p_config != NULL);
  ASSERT_DBG_PARAM(IS_TAMP_ACTIVE_OUTPUT_PERIOD(p_config->output_period));
  ASSERT_DBG_PARAM(IS_TAMP_ACTIVE_FILTER(p_config->filter));
  ASSERT_DBG_PARAM(IS_TAMP_ACTIVE_ASYNCHRONOUS_PRESCALER(p_config->asynchronous_prescaler));
  ASSERT_DBG_PARAM(IS_TAMP_ACTIVE_OUTPUT_SHARED(p_config->shared_output));


#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_config == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

#if defined(STM32U575xx) || defined(STM32U585xx)
  uint32_t revision_id = LL_DBGMCU_GetRevisionID();

  if ((revision_id == LL_DBGMCU_REV_ID_X)
      && (p_config->asynchronous_prescaler == HAL_TAMP_ACTIVE_PRESCALER_RTCCLK_DIV_2048))
  {
    return HAL_ERROR;
  }
#endif /* defined(STM32U575xx) || defined(STM32U585xx) */

  LL_TAMP_ATAMP_SetConfig((uint32_t)p_config->filter, p_config->output_period,
                          (uint32_t)p_config->shared_output,
                          (uint32_t)p_config->asynchronous_prescaler);

  return HAL_OK;
}

/**
  * @brief Retrieve the active tampers global parameters.
  * @param p_config Pointer to the active tampers global configuration instance.
  */
void HAL_TAMP_ACTIVE_GetConfig(hal_tamp_active_config_t *p_config)
{
  uint32_t value_temp = LL_TAMP_ATAMP_GetConfig();

  ASSERT_DBG_PARAM(p_config != NULL);

  p_config->filter = (hal_tamp_active_filter_state_t) LL_TAMP_ACTIVE_GET_FILTER(value_temp);
  p_config->output_period = LL_TAMP_ACTIVE_GET_OUTPUT_PERIOD(value_temp);
  p_config->shared_output = (hal_tamp_active_output_shared_t) LL_TAMP_ACTIVE_GET_SHARING(value_temp);
  p_config->asynchronous_prescaler = (hal_tamp_active_prescaler_t) LL_TAMP_ACTIVE_GET_PRESCALER(value_temp);
}

/**
  * @brief Configure the active tampers individual parameters
  * @param tampers_input tampers input to be configured, can be a combination of
  *        @arg @ref HAL_TAMP_TAMPER_1
  *        @arg @ref HAL_TAMP_TAMPER_2
  *        @arg @ref HAL_TAMP_TAMPER_3
  *        @arg @ref HAL_TAMP_TAMPER_4
  *        @arg @ref HAL_TAMP_TAMPER_5
  *        @arg @ref HAL_TAMP_TAMPER_6
  *        @arg @ref HAL_TAMP_TAMPER_7
  *        @arg @ref HAL_TAMP_TAMPER_8
  * @param p_config Pointer to the active tamper individual configuration instance.
  * @retval HAL_OK
  */
hal_status_t HAL_TAMP_ACTIVE_SetConfigTampers(uint32_t tampers_input,
                                              const hal_tamp_active_individual_config_t *p_config)
{
  uint32_t tamper_index;
  uint32_t tamp_bool;
  uint32_t tamp_pos;
  uint32_t register_value = 0U;
  uint32_t bits_to_change = 0U;
  uint32_t tamper_output;
  uint32_t tamper_erase_secrets;

  ASSERT_DBG_PARAM(p_config != NULL);
  ASSERT_DBG_PARAM(IS_TAMP_TAMPERS(tampers_input));
  ASSERT_DBG_PARAM(IS_TAMP_ACTIVE_ERASE(p_config->erase_secrets));
  ASSERT_DBG_PARAM(IS_TAMP_ACTIVE_TAMPER_OUTPUT(p_config->tamper_output));

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_config == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  tamper_output = (uint32_t)(p_config->tamper_output);
  tamper_erase_secrets = (uint32_t)(p_config->erase_secrets);

  if (LL_TAMP_ATAMP_IsEnabledOutputSharing() == 1U)
  {
    for (tamper_index = 0U; tamper_index < LL_TAMP_NUMBER_TAMPERS; tamper_index++)
    {
      tamp_bool = (tampers_input >> tamper_index) & 1U;

