STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_hal_tamp.c
      tamp_pos = (tamper_index * 3U);

      register_value = register_value | ((tamp_bool * tamper_output) << tamp_pos);
      bits_to_change = bits_to_change | ((tamp_bool * 0x700U) << tamp_pos);

    }
    LL_TAMP_ATAMP_SetSharedOutputs(bits_to_change, register_value);
  }

  LL_TAMP_SetConfigTampers(tampers_input, 0, tamper_erase_secrets, 0);

  return HAL_OK;
}

/**
  * @brief Retrieve the active tamper individual configuration
  * @param tamper_input tampers input to be configured, can be one of the following values
  *        @arg @ref HAL_TAMP_TAMPER_1
  *        @arg @ref HAL_TAMP_TAMPER_2
  *        @arg @ref HAL_TAMP_TAMPER_3
  *        @arg @ref HAL_TAMP_TAMPER_4
  *        @arg @ref HAL_TAMP_TAMPER_5
  *        @arg @ref HAL_TAMP_TAMPER_6
  *        @arg @ref HAL_TAMP_TAMPER_7
  *        @arg @ref HAL_TAMP_TAMPER_8
  * @param p_config Pointer to the active tamper individual configuration instance.
  */
void HAL_TAMP_ACTIVE_GetConfigTamper(uint32_t tamper_input, hal_tamp_active_individual_config_t *p_config)
{
  uint32_t value_shared_output;
  uint32_t first_tamper_set_pos;
  uint32_t atamp_pos;

  uint32_t config_tamper = LL_TAMP_GetConfigTampers(tamper_input);
  uint32_t tamper_output;

  ASSERT_DBG_PARAM(p_config != NULL);
  ASSERT_DBG_PARAM(IS_TAMP_TAMPERS(tamper_input));

  p_config->erase_secrets = (hal_tamp_active_secrets_erase_t) LL_TAMP_GET_NOERASE(config_tamper);

  if (LL_TAMP_ATAMP_IsEnabledOutputSharing() == 1U)
  {
    value_shared_output = LL_TAMP_ATAMP_GetSharedOutputSelection();
    first_tamper_set_pos = (31U - (__CLZ(tamper_input)));
    if (first_tamper_set_pos <= (LL_TAMP_NUMBER_TAMPERS - 1U))
    {
      atamp_pos = (first_tamper_set_pos * 3U);
      tamper_output = ((value_shared_output >> atamp_pos) & 0x700U);
      p_config->tamper_output = (hal_tamp_active_output_tampers_t)tamper_output;
    }
  }
}

/**
  * @brief Start the active tampers.
  * @param tampers active tampers to activate, can be a combination of
  *        @arg @ref HAL_TAMP_TAMPER_1
  *        @arg @ref HAL_TAMP_TAMPER_2
  *        @arg @ref HAL_TAMP_TAMPER_3
  *        @arg @ref HAL_TAMP_TAMPER_4
  *        @arg @ref HAL_TAMP_TAMPER_5
  *        @arg @ref HAL_TAMP_TAMPER_6
  *        @arg @ref HAL_TAMP_TAMPER_7
  *        @arg @ref HAL_TAMP_TAMPER_8
  * @param interruption enable the interruption, can be a combination of these values.
  *        @arg @ref HAL_TAMP_IT_NONE
  *        @arg @ref HAL_TAMP_IT_TAMPER_1
  *        @arg @ref HAL_TAMP_IT_TAMPER_2
  *        @arg @ref HAL_TAMP_IT_TAMPER_3
  *        @arg @ref HAL_TAMP_IT_TAMPER_4
  *        @arg @ref HAL_TAMP_IT_TAMPER_5
  *        @arg @ref HAL_TAMP_IT_TAMPER_6
  *        @arg @ref HAL_TAMP_IT_TAMPER_7
  *        @arg @ref HAL_TAMP_IT_TAMPER_8
  * @param p_seeds Pointer to the seed values. It must be a table with 4 elements.
  * @warning All needed active tampers must be started at the same time.
  * @retval HAL_ERROR If trying to start active tampers when they are already passive tampers and enabled.
                      or if trying to start active tampers when active tampers are already enabled.
  * @retval HAL_OK
  */
hal_status_t HAL_TAMP_ACTIVE_Start(uint32_t tampers, uint32_t interruption, const uint32_t *p_seeds)
{
  ASSERT_DBG_PARAM(p_seeds != NULL);
  ASSERT_DBG_PARAM(IS_TAMP_TAMPERS(tampers));
  ASSERT_DBG_PARAM(IS_TAMP_TAMPERS_IT(interruption));

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_seeds == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  uint32_t active_tampers = LL_TAMP_ATAMP_GetActiveMode();
  uint32_t enabled_tampers = LL_TAMP_GetEnabled(LL_TAMP_ALL);

  /* Verify that there is no enabled active tampers */
  if ((active_tampers & enabled_tampers) != 0U)
  {
    return HAL_ERROR;
  }

  if ((((~active_tampers) & enabled_tampers) & tampers) != 0U)
  {
    return HAL_ERROR;
  }

  LL_TAMP_ATAMP_EnableActiveMode(tampers);

  LL_TAMP_Enable(tampers);
  LL_TAMP_EnableIT(interruption);

  for (uint32_t seed_index = 0U; seed_index < 4U; seed_index++)
  {
    LL_TAMP_ATAMP_WriteSeed(p_seeds[seed_index]);
  }

  return HAL_OK;
}

/**
  * @brief Stop the active tampers.
  * @param tampers active tampers to stop, can be a combination of
  *        @arg @ref HAL_TAMP_TAMPER_1
  *        @arg @ref HAL_TAMP_TAMPER_2
  *        @arg @ref HAL_TAMP_TAMPER_3
  *        @arg @ref HAL_TAMP_TAMPER_4
  *        @arg @ref HAL_TAMP_TAMPER_5
  *        @arg @ref HAL_TAMP_TAMPER_6
  *        @arg @ref HAL_TAMP_TAMPER_7
  *        @arg @ref HAL_TAMP_TAMPER_8
  * @warning All needed active tampers must be stopped at the same time.
  * @retval HAL_OK
  */
hal_status_t HAL_TAMP_ACTIVE_Stop(uint32_t tampers)
{
  ASSERT_DBG_PARAM(IS_TAMP_TAMPERS(tampers));

  LL_TAMP_Disable(tampers);
  LL_TAMP_DisableIT(tampers);
  LL_TAMP_ClearFlag_TAMP(tampers);

  return HAL_OK;
}

/**
  * @brief Program a new seed for the pseudo-random number generator (PRNG)
  * @param p_seeds Pointer to the seeds values
  * @retval HAL_OK
  * @retval HAL_INVALID_PARAM when p_seeds is null.
  */
hal_status_t HAL_TAMP_ACTIVE_SetSeed(const uint32_t *p_seeds)
{

  ASSERT_DBG_PARAM(p_seeds != NULL);

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_seeds == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  for (uint32_t seed_index = 0U; seed_index < 4U; seed_index++)
  {
    LL_TAMP_ATAMP_WriteSeed(p_seeds[seed_index]);
  }

  return HAL_OK;
}

#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
/**
  * @brief  Read pseudo-random generator value.
  * @param p_prng Pointer to the pseudo-random generator value
  * @retval HAL_OK
  * @retval HAL_ERROR when read value is not correct
  */
hal_status_t HAL_TAMP_ACTIVE_GetPRNG(uint32_t *p_prng)
{
  /* Due to synchronization delays, PRNG must be read at least twice */
  __IO uint32_t prng_value_1 = LL_TAMP_ReadPRNG();
  __IO uint32_t prng_value_2 = LL_TAMP_ReadPRNG();

  /* Use temporary variables to store the volatile values */
  uint32_t temp_value_1 = prng_value_1;
  uint32_t temp_value_2 = prng_value_2;

  /* Read value is correct if it is equal to previous read value */
  if (temp_value_1 == temp_value_2)
  {
    *p_prng = prng_value_2;
  }
  else
  {
    return HAL_ERROR;
  }
  return HAL_OK;
}
#endif /* __ARM_FEATURE_CMSE */

/**
  * @brief Poll for a tamper event among the tampers given in @p tampers
  * @note  Call HAL_TAMP_ACTIVE_Stop to clear the pending tamper event.
  * @param tampers tampers to be checked, can be a combination of
  *        @arg @ref HAL_TAMP_TAMPER_1
  *        @arg @ref HAL_TAMP_TAMPER_2
  *        @arg @ref HAL_TAMP_TAMPER_3
  *        @arg @ref HAL_TAMP_TAMPER_4
  *        @arg @ref HAL_TAMP_TAMPER_5
  *        @arg @ref HAL_TAMP_TAMPER_6
  *        @arg @ref HAL_TAMP_TAMPER_7
  *        @arg @ref HAL_TAMP_TAMPER_8
  * @param timeout_ms Timeout duration
  * @retval HAL_OK
  * @retval HAL_TIMEOUT when reaching the timeout during polling.
  */
hal_status_t HAL_TAMP_ACTIVE_PollForEvent(uint32_t tampers, uint32_t timeout_ms)
{
  uint32_t tickstart = HAL_GetTick();

  ASSERT_DBG_PARAM(IS_TAMP_TAMPERS(tampers));

  while (LL_TAMP_IsActiveFlag_TAMP(tampers) == 0U)
  {
    if (timeout_ms != HAL_MAX_DELAY)
    {
      if (((HAL_GetTick() - tickstart) > timeout_ms) || (timeout_ms == 0U))
      {
        /* New check to avoid false timeout detection in case of preemption */
        if (LL_TAMP_IsActiveFlag_TAMP(tampers) == 0U)
        {
          return HAL_TIMEOUT;
        }
        else
        {
          break;
        }
      }
    }
  }

  return HAL_OK;
}


/**
  * @}
  */

/** @addtogroup TAMP_Exported_Functions_IRQ
  * @brief TAMPER IRQ handler exported functions
  * @{
  * IRQ handler functions to manage the different tamper event interruptions.
  */

/**
  * @brief IRQ handler of the different tamper interruptions.
  */
void HAL_TAMP_IRQHandler(void)
{
  uint32_t flags = LL_TAMP_READ_REG(SR);
  uint32_t flags_tamper = flags & LL_TAMP_ALL;

