STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_hal_tamp.c
  if (flags_tamper != 0U)
  {
    HAL_TAMP_TamperEventCallback(flags_tamper);
    LL_TAMP_ClearFlag_TAMP(flags_tamper);
  }
  else
  {
    uint32_t flags_internal_tamper = flags & LL_TAMP_ITAMP_ALL;
    if (flags_internal_tamper != 0U)
    {
      HAL_TAMP_InternalTamperEventCallback(flags_internal_tamper);
      LL_TAMP_ClearFlag_ITAMP(flags_internal_tamper);
    }
  }
}

/**
  * @brief IRQ handler of the external tampers interruptions.
  */
void HAL_TAMP_TamperIRQHandler(void)
{
  uint32_t flags_tamper = LL_TAMP_READ_REG(SR) & LL_TAMP_ALL;

  if (flags_tamper != 0U)
  {
    HAL_TAMP_TamperEventCallback(flags_tamper);
    LL_TAMP_ClearFlag_TAMP(flags_tamper);
  }
}

/**
  * @brief IRQ handler of the internal tampers interruptions.
  */
void HAL_TAMP_InternalTamperIRQHandler(void)
{
  uint32_t flags_internal_tamper = LL_TAMP_READ_REG(SR) & LL_TAMP_ITAMP_ALL;

  if (flags_internal_tamper != 0U)
  {
    HAL_TAMP_InternalTamperEventCallback(flags_internal_tamper);
    LL_TAMP_ClearFlag_ITAMP(flags_internal_tamper);
  }
}

/**
  * @}
  */

/** @addtogroup TAMP_Exported_Functions_Monotonic_Counters
  * @brief Monotonic counter exported functions.
  * @{
  *
  * The monotonic counter is a simple counter that the user can only increment
  * step by step. To increment the value and read the value the application must call
  * @ref HAL_TAMP_MONOTONIC_IncrementCounter and @ref HAL_TAMP_MONOTONIC_GetCounter.
  *
  */

/**
  * @brief Increment the value of the monotonic counter index
  * @param index monotonic counter index
  * @retval HAL_OK
  */
hal_status_t HAL_TAMP_MONOTONIC_IncrementCounter(hal_tamp_monotonic_counter_t index)
{
  ASSERT_DBG_PARAM(IS_TAMP_MONOTONIC_COUNTER(index));

  STM32_UNUSED(index);

  LL_TAMP_IncrementMonotonicCounter1();

  return HAL_OK;
}

/**
  * @brief Retrieves the value of the monotonic counter
  * @param index monotonic counter index.
  * @retval uint32_t Value of the monotonic counter.
  */
uint32_t HAL_TAMP_MONOTONIC_GetCounter(hal_tamp_monotonic_counter_t index)
{
  ASSERT_DBG_PARAM(IS_TAMP_MONOTONIC_COUNTER(index));
  STM32_UNUSED(index);

  return LL_TAMP_GetMonotonicCounter1();
}
/**
  * @}
  */

/** @addtogroup TAMP_Exported_Functions_Device_Secrets
  * @{
  * The device secrets consists of different resources of the microcontroller
  *
  * # Backup registers
  *
  * There are 32 backup registers.
  * The backup registers are registers that the application can write anything it wants by
  * calling @ref HAL_TAMP_WriteBackupRegisterValue .
  *
  * # Hardware boot key block
  *
  * The eight first backup registers can be used to store a boot hardware key (BHK) for the secure AES. For this
  * purpose, they must be defined in the third zone described above. First the user needs to program the third zone
  * accordingly by protecting them and then write the key in the eight first
  * registers.
  * To block the access to the hardware boot key, the application needs
  * to call @ref HAL_TAMP_EnableHardwareBootkeyBlock.
  * These events unblocked the access to the hardware boot key:
  * * a tamper event;
  * * calling @ref HAL_TAMP_EraseDeviceSecrets (BKERASE).
  *
  * In all cases the backup registers are also erased.
  *
  * # Device secrets access and erase.
  *
  * The application can enable and disable the access of the different device secrets by calling
  * @ref HAL_TAMP_UnblockDeviceSecretsAccess and @ref HAL_TAMP_BlockDeviceSecretsAccess respectively.
  * By default they can be accessed.
  *
  * The application can also manually erase the different device secrets by calling
  * the @ref HAL_TAMP_EraseDeviceSecrets function.
  *
  */

/**
  * @brief Program the value of the backup register given by the parameter @p backup_register_index.
  * @param backup_register_index Index of the backup register.
  * @param data_32bit Value to be programmed.
  * @retval HAL_OK
  */
hal_status_t HAL_TAMP_WriteBackupRegisterValue(hal_tamp_backup_register_idx_t backup_register_index,
                                               uint32_t data_32bit)
{
  ASSERT_DBG_PARAM(IS_TAMP_BACKUP_REGISTER((uint32_t)backup_register_index));

  LL_TAMP_BKP_SetRegister((uint32_t)backup_register_index, data_32bit);

  return HAL_OK;
}

/**
  * @brief Retrieve the value of the backup register given by the parameter @p backup_register_index.
  * @param backup_register_index Index of the backup register.
  * @retval uint32_t Value of the backup register
  */
uint32_t HAL_TAMP_ReadBackupRegisterValue(hal_tamp_backup_register_idx_t backup_register_index)
{
  ASSERT_DBG_PARAM(IS_TAMP_BACKUP_REGISTER((uint32_t)backup_register_index));

  return LL_TAMP_BKP_GetRegister((uint32_t)backup_register_index);
}


/**
  * @brief Unblock access to the backup registers and device secrets.
  * @retval HAL_OK
  */
hal_status_t HAL_TAMP_UnblockDeviceSecretsAccess(void)
{
  LL_TAMP_UnblockDeviceSecretsAccess();

  return HAL_OK;
}

/**
  * @brief Block access to the backup registers and devices secrets.
  * @retval HAL_OK
  */
hal_status_t HAL_TAMP_BlockDeviceSecretsAccess(void)
{
  LL_TAMP_BlockDeviceSecretsAccess();

  return HAL_OK;
}

/**
  * @brief Check if the access to the devices secrets is blocked.
  * @retval hal_tamp_secrets_status_t Device secrets access status.
  */
hal_tamp_secrets_status_t HAL_TAMP_IsBlockedDeviceSecretsAccess(void)
{
  return (hal_tamp_secrets_status_t) LL_TAMP_IsBlockedDeviceSecretsAccess();
}

/**
  * @brief Erase the backup registers and device secrets.
  * @retval HAL_OK
  */
hal_status_t HAL_TAMP_EraseDeviceSecrets(void)
{
  LL_TAMP_EraseDeviceSecrets();
  return HAL_OK;
}

/**
  * @brief Enable the protection as device secrets of the resource given
  *        by the parameter @p resources.
  * @param resources Resources to be protected, can be a combination of
  *        @arg @ref HAL_TAMP_BACKUP_SRAM
  *        @arg @ref HAL_TAMP_RESOURCES_ALL
  * @retval HAL_OK
  */
hal_status_t HAL_TAMP_EnableResourceProtection(uint32_t resources)
{
  ASSERT_DBG_PARAM(IS_TAMP_RESOURCES(resources));

  LL_TAMP_EnableResourceProtection(resources);
  return HAL_OK;
}

/**
  * @brief Disable the protection as device secrets of the resource given
  *        by the parameter @p resources.
  * @param resources Resources to be protected, can be a combination of
  *        @arg @ref HAL_TAMP_BACKUP_SRAM
  *        @arg @ref HAL_TAMP_RESOURCES_ALL
  * @retval HAL_OK
  */
hal_status_t HAL_TAMP_DisableResourceProtection(uint32_t resources)
{
  ASSERT_DBG_PARAM(IS_TAMP_RESOURCES(resources));

  LL_TAMP_DisableResourceProtection(resources);
  return HAL_OK;
}

/**
  * @brief Check if the resources given by the parameter @p resources are protected as
  *        device secrets.
  * @param resources Resources to be protected, can be a combination of
  *        @arg @ref HAL_TAMP_BACKUP_SRAM
  *        @arg @ref HAL_TAMP_RESOURCES_ALL
  * @retval hal_tamp_protect_resources_status_t Resource protection status.
  */
hal_tamp_protect_resources_status_t HAL_TAMP_IsEnabledResourceProtection(uint32_t resources)
{
  ASSERT_DBG_PARAM(IS_TAMP_RESOURCES(resources));

  return (hal_tamp_protect_resources_status_t) LL_TAMP_IsEnabledResourceProtection(resources);
}

/**
  * @brief Blocks access to the eight first backup registers corresponding to the hardware boot key.
  * @note The eight first backup registers must be part of the third zone protection
  * @retval HAL_OK
  */
hal_status_t HAL_TAMP_EnableHardwareBootkeyBlock(void)
{
  LL_TAMP_EnableHardwareBootkeyBlock();
  return HAL_OK;
}

/**
  * @brief Check if the eight first backup registers corresponding to the hardware boot key are blocked.
  * @retval hal_tamp_hardware_bootkey_status_t Status of the hardware boot key access
  */
hal_tamp_hardware_bootkey_status_t HAL_TAMP_IsEnabledHardwareBootkeyBlock(void)
{
  return (hal_tamp_hardware_bootkey_status_t) LL_TAMP_IsEnabledHardwareBootkeyBlock();
}

/**
  * @}
  */

/** @addtogroup TAMP_Exported_Functions_Callback TAMP exported callback functions
  * @brief Callback exported functions
  * @{
  *
  * Callback functions that the user can overwrite for the different interruption:
  * * Internal tampers.
  * * External tampers.
  */

/**
  * @brief Internal tamper event callback
  */
__WEAK void HAL_TAMP_InternalTamperEventCallback(uint32_t internal_tampers)
{
  STM32_UNUSED(internal_tampers);
  /* NOTE: This function must not be modified in this file, when the callback is needed,
           the HAL_TAMP_InternalTamperEventCallback() can be implemented in the user file.
   */
}

/**
  * @brief External tamper event callback
  */
__WEAK void HAL_TAMP_TamperEventCallback(uint32_t tampers)
{
  STM32_UNUSED(tampers);
  /* NOTE: This function must not be modified in this file, when the callback is needed,
           the HAL_TAMP_TamperEventCallback() can be implemented in the user file.
   */
}

/**
  * @}
  */

/**
  * @}
  */

#endif /* USE_HAL_TAMP_MODULE */

/**
  * @}
  */

/**
  * @}
  */
